Terraform plan for __staging__
<details>
  <summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # kubernetes_limit_range.cluster_limit["ebo"] will be created
  + resource "kubernetes_limit_range" "cluster_limit" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "default-limit"
          + namespace        = "ebo"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + limit {
              + default         = {
                  + "memory" = "800m"
                }
              + default_request = {
                  + "cpu"    = "500m"
                  + "memory" = "800m"
                }
              + type            = "Container"
            }
        }
    }

  # module.jumpbox.kubernetes_deployment.jumpbox_deployment will be destroyed
  - resource "kubernetes_deployment" "jumpbox_deployment" {
      - id               = "default/jumpbox" -> null
      - wait_for_rollout = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "jumpbox" -> null
          - namespace        = "default" -> null
          - resource_version = "9019733" -> null
          - uid              = "d6c3c421-153b-4a36-9af4-6f7fd81d4b9d" -> null
        }

      - spec {
          - min_ready_seconds         = 0 -> null
          - paused                    = false -> null
          - progress_deadline_seconds = 600 -> null
          - replicas                  = "1" -> null
          - revision_history_limit    = 10 -> null

          - selector {
              - match_labels = {
                  - "name" = "jumpbox"
                } -> null
            }

          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          - template {
              - metadata {
                  - annotations = {} -> null
                  - generation  = 0 -> null
                  - labels      = {
                      - "name" = "jumpbox"
                    } -> null
                }

              - spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = true -> null
                  - dns_policy                       = "ClusterFirst" -> null
                  - enable_service_links             = true -> null
                  - host_ipc                         = false -> null
                  - host_network                     = false -> null
                  - host_pid                         = false -> null
                  - node_selector                    = {} -> null
                  - restart_policy                   = "Always" -> null
                  - share_process_namespace          = false -> null
                  - termination_grace_period_seconds = 30 -> null

                  - container {
                      - args                       = [] -> null
                      - command                    = [
                          - "sleep",
                          - "infinity",
                        ] -> null
                      - image                      = "us.gcr.io/ebo-dev-321910/jumpbox@sha256:2029b0e087aea9f062adecde6f780b63778a1d52561d16cbb0e358d2a3368dc2" -> null
                      - image_pull_policy          = "Always" -> null
                      - name                       = "jumpbox" -> null
                      - stdin                      = false -> null
                      - stdin_once                 = false -> null
                      - termination_message_path   = "/dev/termination-log" -> null
                      - termination_message_policy = "File" -> null
                      - tty                        = false -> null

                      - resources {}
                    }

                  - image_pull_secrets {
                      - name = "gcr-json-key" -> null
                    }
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 4, in module "jumpbox":
   4:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

Plan generated in [Terraform #132](https://github.com/ebomart/commerce-infrastructure/actions/runs/1212144931)